source/_posts/2016-02-28-understand-javascript-closure.html
---
title: "理解 Javascript 的闭包"
date: 2016-02-28
layout: post
categories: 
- Javascript
tags: 
- Javascript
published: true
comments: 
---
<p>
因为最近几个月一直在做 Cocos Creator 这个项目，大部分时间都在与 Javascript 打交道，所以接下来我有必要写几篇文章介绍一下 JS 里面几个比较让人迷惑的地方：闭包，变量作用域，变量提升和 this 绑定。
</p>

<p>
今天这篇文章我们来聊一聊闭包。
</p>

<p>
<!-- more -->
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">什么是闭包？</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
<b>闭包是一个函数，它在函数内部创建，并且携带了自身创建时的所处环境信息（比如变量信息和其它函数信息）。</b>
</p>

<p>
上面这段话是引用至 MDN，它很清楚地说明了什么是闭包。
</p>

<p>
闭包 = 函数内部创建的函数（或者简称内部函数） + 该函数创建时所处环境信息
</p>

<p>
所以闭包并不等于匿名函数，虽然也有人称这些在函数内部创建的函数为闭包函数，但是我觉得其实并不准确。
</p>

<p>
我们看一下下面这段代码：
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">init</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">name</span> = <span style="color: #E6DB74;">"Zilongshanren"</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">name &#26159;&#22312; init &#20989;&#25968;&#37324;&#38754;&#21019;&#24314;&#30340;&#21464;&#37327;</span>
    <span style="color: #75715E;">// </span><span style="color: #75715E;">displayName() &#26159;&#19968;&#20010;&#20869;&#37096;&#20989;&#25968;&#65292;&#21363;&#19968;&#20010;&#38381;&#21253;&#12290;&#27880;&#24847;&#65292;&#23427;&#19981;&#26159;&#21311;&#21517;&#30340;&#12290;</span>
    <span style="color: #F92672;">function</span> <span style="color: #A6E22E;">displayName</span><span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
        console.log<span style="color: #A6E22E;">(</span>name<span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #75715E;">//</span><span style="color: #75715E;">&#24403; displayName &#20989;&#25968;&#36820;&#22238;&#21518;&#65292;&#36825;&#20010;&#20989;&#25968;&#36824;&#33021;&#35775;&#38382; init &#20989;&#25968;&#37324;&#38754;&#23450;&#20041;&#30340;&#21464;&#37327;&#12290;</span>
    <span style="color: #F92672;">return</span> displayName;
<span style="color: #AE81FF;">}</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">closure</span> = init<span style="color: #AE81FF;">()</span>;
closure<span style="color: #AE81FF;">()</span>;
</pre>
</div>

<pre class="example">
Zilongshanren
undefined
</pre>

<p>
<code>displayName</code> 是一个在 <code>init</code> 函数内部创建的函数，它携带了 init 函数内部作用域的所有信息，比如这里的 <code>name</code> 变量。当 displayName 函数返回的时候，它本身携带了当时创建时的环境信息，即 init 函数里面的 <code>name</code> 变量。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">闭包有什么作用？</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
在理解什么是闭包之后，接下来你可能会问：这东西这么难理解，它到底有什么用啊？
</p>

<p>
因为在 Js 里面是没有办法创建私有方法的，它不像 java 或者 C++有什么 private 关键字可以定义私有的属性和方法。
Js 里面只有函数可以创建出属于自身的作用域的对象，Js 并没有块作用域！这个我后面会再写一篇文章详细介绍。
</p>

<p>
编程老鸟都知道，程序写得好，封装和抽象要运用得好！不能定义私有的属性和方法，意味着封装和抽象根本没法用。。。
</p>

<p>
不能定义私有的东西，所有变量和函数都 public 显然有问题， <code>Global is Evil！</code>
</p>

<p>
闭包是我们的救星！
</p>

<p>
我们看一下下面这段代码：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">makeCounter</span> = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">privateCounter</span> = <span style="color: #AE81FF;">0</span>;
    <span style="color: #F92672;">function</span> <span style="color: #A6E22E;">changeBy</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">val</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        privateCounter += val;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #F92672;">return</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E;">increment</span>: <span style="color: #F92672;">function</span><span style="color: #A6E22E;">()</span> <span style="color: #A6E22E;">{</span>
            changeBy<span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">1</span><span style="color: #E6DB74;">)</span>;
        <span style="color: #A6E22E;">}</span>,
        <span style="color: #A6E22E;">decrement</span>: <span style="color: #F92672;">function</span><span style="color: #A6E22E;">()</span> <span style="color: #A6E22E;">{</span>
            changeBy<span style="color: #E6DB74;">(</span>-<span style="color: #AE81FF;">1</span><span style="color: #E6DB74;">)</span>;
        <span style="color: #A6E22E;">}</span>,
        <span style="color: #A6E22E;">value</span>: <span style="color: #F92672;">function</span><span style="color: #A6E22E;">()</span> <span style="color: #A6E22E;">{</span>
            <span style="color: #F92672;">return</span> privateCounter;
        <span style="color: #A6E22E;">}</span>
    <span style="color: #66D9EF;">}</span>
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">var</span> <span style="color: #FD971F;">counter1</span> = makeCounter<span style="color: #AE81FF;">()</span>;
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">counter2</span> = makeCounter<span style="color: #AE81FF;">()</span>;
console.log<span style="color: #AE81FF;">(</span>counter1.value<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Alerts 0 */</span>
counter1.increment<span style="color: #AE81FF;">()</span>;
counter1.increment<span style="color: #AE81FF;">()</span>;
console.log<span style="color: #AE81FF;">(</span>counter1.value<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Alerts 2 */</span>
counter1.decrement<span style="color: #AE81FF;">()</span>;
console.log<span style="color: #AE81FF;">(</span>counter1.value<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Alerts 1 */</span>
console.log<span style="color: #AE81FF;">(</span>counter2.value<span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Alerts 0 */</span>
</pre>
</div>

<pre class="example">
0
2
1
0
undefined
</pre>

<p>
这里面的 <code>privateCounter</code> 变量和 <code>changeBy</code> 都是私有的，对于 makeCounter 函数外部是完全不可见的。这样我们通过 <code>makeCounter</code> 生成的对象就把自己的私有数据和私有方法全部隐藏起来了。
</p>

<p>
这里有没有让你想到点什么？
</p>

<p>
哈哈，这不就是 OO 么？封装数据和操作数据的方法，然后通过公共的接口调用来完成数据处理。
</p>

<p>
当然，你也许会说，我用原型继承也可以实现 OO 呀。没错，现在大部分人也正是这么干的，包括我们自己。不过继承这个东西，在理解起来总是非常困难的，因为要理解一段代码，你必须要理解它的所有继承链。如果一旦代码出 bug 了，这将是非常难调试的。
</p>

<p>
扯远了，接下来，让我们看看如何正确地使用闭包。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">如何正确地使用闭包？</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
闭包会占用内存，也会影响 js 引擎的执行效率，所以，如果一段代码被频繁执行，那么要谨慎考虑在这段代码里面使用闭包。
</p>

<p>
让我们来看一个创建对象的函数：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">MyObject</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">name</span>, <span style="color: #FD971F;">message</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #AE81FF;">this</span>.name = name.toString<span style="color: #66D9EF;">()</span>;
    <span style="color: #AE81FF;">this</span>.message = message.toString<span style="color: #66D9EF;">()</span>;
    <span style="color: #AE81FF;">this</span>.getName = <span style="color: #F92672;">function</span><span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">this</span>.name;
    <span style="color: #66D9EF;">}</span>;

    <span style="color: #AE81FF;">this</span>.getMessage = <span style="color: #F92672;">function</span><span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">this</span>.message;
    <span style="color: #66D9EF;">}</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #F92672;">var</span> <span style="color: #FD971F;">myobj</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">MyObject</span><span style="color: #AE81FF;">()</span>;
</pre>
</div>

<p>
<code>var myobj = new MyObject();</code> 每一次被调用生成一个新对象的时候，都会生成两个闭包。如果你的程序里面有成千上万个这样的 <code>MyObject</code> 对象，那么会额外多出很多内存占用。
</p>

<p>
正确的做法应该是使用原型链：
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">MyObject</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">name</span>, <span style="color: #FD971F;">message</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #AE81FF;">this</span>.name = name.toString<span style="color: #66D9EF;">()</span>;
    <span style="color: #AE81FF;">this</span>.message = message.toString<span style="color: #66D9EF;">()</span>;
<span style="color: #AE81FF;">}</span>
MyObject.<span style="color: #AE81FF;">prototype</span>.getName = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">this</span>.name;
<span style="color: #AE81FF;">}</span>;
MyObject.<span style="color: #AE81FF;">prototype</span>.getMessage = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">this</span>.message;
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">var</span> <span style="color: #FD971F;">myobj</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">MyObject</span><span style="color: #AE81FF;">()</span>;
</pre>
</div>

<p>
现在 <code>MyObject</code> 原型上面定义了两个方法，当我们通过 new 去创建对象的时候，这两个方法只会在原型上面存有一份。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">闭包的性能如何？</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
闭包也是一个函数，但是它存储了额外的环境信息，所以理论上它比纯函数占用更多的内存，而且 Js 引擎在解释执行闭包的时候消耗也更大。不过它们之间的性能差别在 3%和 5%之间（这是 Google 上得到的数据，可能不是太准确）。
</p>

<p>
但是，闭包的好处肯定是大大的。多使用闭包和无状态编程，让 Bug 从此远离我们。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">小结</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
面向对象是穷人的闭包(OO is a poor man's closure.)
</p>

<p>
理解了闭包，你就能理解大部分 FP 范式的 Js 类库及其隐藏在背后的设计思想。当然仅有闭包还不够，你还需要被 FP 和无状态，lambda calculus 等概念洗脑。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Reference</h2>
<div class="outline-text-2" id="text-orgheadline6">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Closures">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Closures</a></li>
</ul>
</div>
</div>
